//*****************************************************************************
// UniversalVariables.cpp
// 環境の変数
// Author : Mane
//*****************************************************************************
#include "UniversalVariables.h"

//*****************************************************************************
// グローバル変数
//*****************************************************************************
bool bNoStyleNoGame = false;
bool bHellsTouchMode = false;
bool bShowFPS = false;

//*****************************************************************************
//IsNoStyleNoGameOn関数
//NSNGを使っていることを確認する
//引数：void
//戻：bool
//*****************************************************************************
bool IsNoStyleNoGameOn()
{
	return bNoStyleNoGame;
}

//*****************************************************************************
//SetNoStyleNoGame関数
//NSNGを使っていることを設定する
//引数：bool
//戻：void
//*****************************************************************************
void SetNoStyleNoGame(bool nsng)
{
	bNoStyleNoGame = nsng;
}

//*****************************************************************************
//SetShowFPS関数
//FPSを表しているいることを設定する
//引数：bool
//戻：void
//*****************************************************************************
void SetShowFPS(bool show)
{
	bShowFPS = show;
}

//*****************************************************************************
//SetHellsMode関数
//ノーダメージモードを設定する
//引数：bool
//戻：void
//*****************************************************************************
void SetHellsMode(bool set)
{
	bHellsTouchMode = set;
}

//*****************************************************************************
//SetHellsMode関数
//ノーダメージモードが有効を確認する
//引数：void
//戻：bool
//*****************************************************************************
bool IsHellsTouchMode()
{
	return bHellsTouchMode;
}

//*****************************************************************************
//ShowFPS関数
//FPSを表しているいることを確認する
//引数：void
//戻：bool
//*****************************************************************************
bool ShowFPS()
{
	return bShowFPS;
}
